profiling/stage4/stage-4_wrk_put.log
Running 1m test @ http://localhost:8080
  2 threads and 10 connections
  Thread calibration: mean lat.: 1.066ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.076ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms    0.93ms  41.12ms   96.50%
    Req/Sec   524.60     77.66     2.44k    84.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.32ms
 90.000%    1.61ms
 99.000%    3.38ms
 99.900%   10.04ms
 99.990%   35.65ms
 99.999%   41.15ms
100.000%   41.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.084     0.000000            1         1.00
       0.450     0.100000         5029         1.11
       0.612     0.200000        10011         1.25
       0.758     0.300000        15017         1.43
       0.892     0.400000        20011         1.67
       1.021     0.500000        25012         2.00
       1.080     0.550000        27510         2.22
       1.138     0.600000        29999         2.50
       1.196     0.650000        32506         2.86
       1.253     0.700000        35017         3.33
       1.316     0.750000        37496         4.00
       1.349     0.775000        38730         4.44
       1.387     0.800000        39998         5.00
       1.429     0.825000        41252         5.71
       1.478     0.850000        42485         6.67
       1.534     0.875000        43727         8.00
       1.568     0.887500        44352         8.89
       1.609     0.900000        44989        10.00
       1.653     0.912500        45606        11.43
       1.708     0.925000        46227        13.33
       1.777     0.937500        46857        16.00
       1.819     0.943750        47165        17.78
       1.863     0.950000        47477        20.00
       1.916     0.956250        47789        22.86
       1.982     0.962500        48106        26.67
       2.044     0.968750        48417        32.00
       2.083     0.971875        48568        35.56
       2.133     0.975000        48725        40.00
       2.201     0.978125        48880        45.71
       2.341     0.981250        49037        53.33
       2.635     0.984375        49196        64.00
       2.825     0.985938        49272        71.11
       3.009     0.987500        49349        80.00
       3.261     0.989062        49428        91.43
       3.515     0.990625        49505       106.67
       3.889     0.992188        49583       128.00
       4.087     0.992969        49622       142.22
       4.299     0.993750        49661       160.00
       4.499     0.994531        49700       182.86
       4.739     0.995313        49740       213.33
       5.051     0.996094        49779       256.00
       5.255     0.996484        49798       284.44
       5.415     0.996875        49817       320.00
       5.719     0.997266        49837       365.71
       6.215     0.997656        49857       426.67
       7.291     0.998047        49876       512.00
       8.183     0.998242        49886       568.89
       8.559     0.998437        49895       640.00
       8.879     0.998633        49905       731.43
       9.439     0.998828        49915       853.33
      10.415     0.999023        49925      1024.00
      10.871     0.999121        49930      1137.78
      12.335     0.999219        49934      1280.00
      13.791     0.999316        49939      1462.86
      14.871     0.999414        49944      1706.67
      18.271     0.999512        49949      2048.00
      22.239     0.999561        49952      2275.56
      23.279     0.999609        49955      2560.00
      27.135     0.999658        49956      2925.71
      27.727     0.999707        49959      3413.33
      28.127     0.999756        49961      4096.00
      31.743     0.999780        49963      4551.11
      32.223     0.999805        49964      5120.00
      32.719     0.999829        49965      5851.43
      32.799     0.999854        49966      6826.67
      35.615     0.999878        49967      8192.00
      35.647     0.999890        49968      9102.22
      36.191     0.999902        49969     10240.00
      36.191     0.999915        49969     11702.86
      36.415     0.999927        49970     13653.33
      36.415     0.999939        49970     16384.00
      37.151     0.999945        49971     18204.44
      37.151     0.999951        49971     20480.00
      37.151     0.999957        49971     23405.71
      37.503     0.999963        49972     27306.67
      37.503     0.999969        49972     32768.00
      37.503     0.999973        49972     36408.89
      37.503     0.999976        49972     40960.00
      37.503     0.999979        49972     46811.43
      41.151     0.999982        49973     54613.33
      41.151     1.000000        49973          inf
#[Mean    =        1.083, StdDeviation   =        0.926]
#[Max     =       41.120, Total count    =        49973]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59993 requests in 1.00m, 4.75MB read
Requests/sec:    999.84
Transfer/sec:     81.05KB